(function (window) {

    window.bodyPool = [
        {
            name: '头部',
            children: [{
                name: '额头'
            }, {
                name: '脸颊'
            }, {
                name: '鼻子'
            }, {
                name: '嘴唇'
            }, {
                name: '下巴'
            }, {
                name: '耳郭'
            }, {
                name: '耳垂'
            }]
        },
        {
            name: '颈部'
        },
        {
            name: '胸部',
            children: [{
                name: '胸部'
            }, {
                name: '乳头乳晕'
            }]
        },
        {
            name: '腹部'
        },
        {
            name: '肩背'
        },
        {
            name: '手臂',
            children: [{
                name: '上臂'
            }, {
                name: '肘关节内侧'
            }, {
                name: '肘关节外侧'
            }, {
                name: '前臂外侧'
            }, {
                name: '前臂内侧'
            }, {
                name: '腕部'
            }]
        },
        {
            name: '手部',
            children: [{
                name: '手掌'
            }, {
                name: '手背'
            }, {
                name: '手背伸侧'
            }, {
                name: '手臂屈侧'
            }, {
                name: '手指侧缘'
            }, {
                name: '手指缝'
            }, {
                name: '指甲'
            }, {
                name: '手指甲'
            }]
        },
        {
            name: '腿部',
            children: [{
                name: '大腿'
            }, {
                name: '膝关节伸侧'
            }, {
                name: '腋窝'
            }, {
                name: '小腿伸侧'
            }, {
                name: '小腿屈侧'
            }, {
                name: '足踝'
            }]
        },
        {
            name: '脚部',
            children: [{
                name: '足背'
            }, {
                name: '足趾伸侧'
            }, {
                name: '足趾屈侧'
            }, {
                name: '足底'
            }, {
                name: '足心'
            }, {
                name: '足跟'
            }, {
                name: '足趾间'
            }, {
                name: '脚趾甲'
            }]
        },
        {
            name: '大腿根部',
            male: [{
                name: '大腿根部'
            }, {
                name: '阴阜'
            }, {
                name: '会阴部'
            }, {
                name: '阴茎根部'
            }, {
                name: '阴茎体部'
            }, {
                name: '龟头'
            }, {
                name: '冠状沟'
            }, {
                name: '尿道口'
            }, {
                name: '阴茎系带'
            }, {
                name: '阴囊'
            }],
            female: [{
                name: '大腿根部'
            }, {
                name: '阴阜'
            }, {
                name: '会阴部'
            }, {
                name: '大阴唇外侧'
            }, {
                name: '大阴唇内侧'
            }, {
                name: '阴蒂'
            }, {
                name: '小阴唇'
            }, {
                name: '尿道口'
            }, {
                name: '阴道口'
            }, {
                name: '阴道壁'
            }, {
                name: '宫颈口'
            }]
        }
    ];

    window.getBodyParts = function (name, sex) {
        var children = null;
        for (var i = 0; i < bodyPool.length; i++) {
            var part = bodyPool[i];
            if (part.name != name) {
                continue;
            }
            children = part.children || (sex == 1 ? part.male : part.female);
            break;
        }
        return children;
    }

    window.diseasePool = {
        data: ["艾滋病(Aids)[获得性免疫缺陷(不全)]综合症", "艾迪森氏瘢痕疙瘩瘤", "扁平疣", "孢子丝菌病NOS", "扁平苔藓", "白斑[白癜风]", "病灶粘蛋白沉积症", "表浅皮肤溃疡", "白细胞破碎性血管炎", "白色（斑块状）萎缩症", "比耶特氏病", "瘢痕疙瘩", "斑点状皮肤萎缩", "瘢痕畸形", "瘢痕", "瘢痕挛缩", "白斑病", "表皮样囊肿", "鼻赘[肥大性酒槽鼻]", "表皮脱落性痤疮", "瘢痕性脱发NOS", "斑秃NOS", "扁平指（趾）甲", "博氏线", "边缘性红斑", "变应性荨麻疹", "斑状类银屑病[持久性黄色红皮病]", "斑块状牛皮癣", "白色糠疹[面部单纯糠疹]", "剥落性皮炎", "斑蝥皮炎", "播散性神经性皮炎", "贝尼耶痒疹", "巴西天胞疮", "背部感染性窦道", "臂急性淋巴管炎", "背蜂窝组织炎", "臂蜂窝织炎", "瘭疽[化脓性指头炎]", "臂脓肿", "臂部痈", "背部痈", "背部脓肿", "伯克哈特脓疱病", "瘢痕疙瘩型毛囊炎", "白塞病", "变应性皮肤血管炎", "鲍温病", "鲍文样丘疹病", "病毒感染", "病毒疣", "传染性软疣", "持久隆起性红斑[伯里病]", "痤疮性瘢瘤", "痤疮NOS", "脆发症", "脆甲症", "持久性肢皮炎[阿烙波肢皮炎]", "擦烂红斑", "擦烂[间擦疹]", "传染性湿疹样皮炎[恩格曼氏病]", "刺激性接触性湿疹", "刺激性皮炎", "刺毛虫皮炎", "唇部痈", "唇部疖", "成人硬肿病", "毳毛囊肿", "痤疮样痣", "点状角化病掌跖", "顶(浆分)泌腺栗疹", "多发性脂囊瘤(皮脂囊瘤病)", "痘样痤疮", "多毛症NOS", "多毛症", "多形红斑(渗出性多形红斑)", "多形性红斑关节病", "胆碱能性荨麻疹", "大疱性扁平苔藓", "大斑块状类牛皮癣", "低状类银屑病(慢性苔藓样糠疹，慢性痘疮样糠疹)", "滴状银屑病", "单纯性苔藓", "稻农皮炎(稻田皮炎)", "大泡性皮炎NOS", "大疱病", "多形性疱疹样皮炎[杜林氏病]", "大疱性类天疱疮", "短暂性棘皮松解皮肤病[格罗弗]", "多发性脓肿", "多发性疖肿", "大疱性脓疱疮", "大疱性表皮松解症", "弹力纤维假黄瘤", "单纯性汗腺棘皮瘤", "Degos病", "弹力纤维溶解性巨细胞肉芽肿", "动脉瘤样纤维组织细胞瘤", "多中心网状组织细胞增生症", "带状疱疹", "恶性黑(色素)瘤NOS", "耳后血肿骨化", "耳后囊肿", "耳郭假性囊肿", "额部脓肿", "Degos病", "弹力纤维溶解性巨细胞肉芽肿", "动脉瘤样纤维组织细胞瘤", "多中心网状组织细胞增生症", "带状疱疹", "发育不良痣", "复合痣", "腹壁溃疡", "肥大性瘢痕", "匐形穿孔性弹性组织变性", "反应性穿孔性胶原病", "匐行性血管瘤", "福克斯-福代斯病[干性栗粒疹综合征]", "痱子[栗疹；汗疹]", "粉刺", "发色异常", "匐行性脱发", "反甲[凹甲；匙状甲]", "放射性皮炎NOS", "非大疱型多形红斑", "复发性周期性荨麻疹", "非变应性荨麻疹", "肥大性扁平苔癣", "匐行性皮炎", "肥大性湿疹", "发部皮脂溢", "泛发性神经性皮炎", "腹壁软组织感染", "腹壁感染性窦道", "蜂窝织炎NOS", "腹股沟感染", "腹壁痈", "腹股沟脓肿", "腹壁脓肿", "反应性穿通性胶原病", "非典型交界痣", "非典型复合痣", "非典型性肢端雀斑样交界痣", "非典型肢端交界痣", "Fox-Fordyce病", "过敏性紫癜[亨诺克(一舍恩莱因)紫癜]", "光泽苔藓", "戈特龙丘疹", "光照性皮炎", "光化性肉芽肿", "光化性类网状细胞增多症", "光化性唇炎[光照性唇炎]", "光接触性皮炎[香料皮炎]", "固定性红斑", "感染性荨麻疹", "肛门生殖器瘙痒症NOS", "肛门搔痒症", "固定性药疹", "汞接触性皮炎", "甘醇溶剂引起的刺激性接触性皮炎", "过敏性皮炎(湿疹)", "铬引起的变应性接触性皮炎", "干性皮脂溢", "腘窝脓肿", "钙化上皮瘤", "黄色肉芽肿", "黄色瘤", "坏死性血管炎", "汗管瘤NOS(D23.-)", "汗孔角化症", "化脓性肉芽肿（毛细管扩张性肉芽肿）", "红斑狼疮", "环形肉芽肿", "坏疽性皮炎", "坏疽性脓皮病", "后天性鱼鳞癣", "黑棘皮病（黑色角化病）", "黑色素形成减少的其他疾患", "黑色素沉着症", "黑皮病", "褐黄斑", "汗臭（腋臭）", "汗腺疾病NOS", "红粟疹", "化脓性破坏性汗腺炎[波利策氏病]", "汗腺炎", "化脓性汗腺炎", "坏死性痤疮", "后天性胎毛过多", "灰发", "后天性局限性白发", "黄甲综合征", "火激皮炎[火激红斑]", "哈钦森夏季疹", "红皮病", "红斑NOS", "环形红斑", "环状疱疹（大疱型多形红斑）", "环形糠疹", "环状（威兰氏癣）牛皮癣", "红皮病性银屑病（银屑病性红皮病）", "汗疱症", "黑布拉痒疹", "黑布拉糠疹", "化纤引起的未特指的皮炎[化纤接触性皮炎]", "化学品接触性皮炎", "化妆品皮炎", "化学产品引起的刺激性接触性皮炎", "化妆品引起的刺激性接触性皮炎", "化妆品引起的变应性接触性皮炎", "红斑尿布", "环形疱疹样大疱病", "后天性大疱性表皮松解", "后天性毛囊角化病", "红斑性天疱疮[厄谢尔-赛尼尔病]", "会阴炎性包块", "会阴部软组织感染", "红癣", "化脓性皮炎", "坏死性淋巴结炎", "化脓性淋巴结炎", "化脓性颈部淋巴结炎", "化脓性面部淋巴结炎", "颌下降区蜂窝织炎", "颌部蜂窝织炎", "踝部脓肿", "会阴部脓肿", "会阴部炎性肿物", "颌下脓肿", "黑踵病", "环状肉芽肿", "获得性太田痣", "黑头粉刺", "汗孔瘤", "汗腺癌", "获得性肢端纤维角皮瘤", "I度晒伤", "II度晒伤", "III度晒伤", "尖锐湿疣", "结节病NOS", "基底细胞癌NOS（C44.-)", "交界痣NOS（D22.-)", "急性发热性中性白细胞皮肤病", "局限于皮肤的脉管炎NOS", "结节性脉管炎", "局限性结缔组织疾患NOS", "局限性硬皮病[硬斑病]", "局限性红斑狼疮", "颈部瘢痕", "经表皮排除疾患NOS", "角化过度", "角化棘皮瘤", "鸡眼", "假黑棘皮病", "胶状粟粒疹", "晶状粟疹", "酒渣鼻NOS", "聚会性痤疮", "局限性多毛症", "结节性脆发病", "假斑秃", "静止期脱发", "甲疾患NOS", "甲床角化过度", "甲肥大", "甲弯曲", "甲脱离（甲分离症）", "急性放射性皮炎", "颈部菱形皮", "角化病NOS", "结节性红斑关节病", "结节性红斑", "急性荨麻疹", "接触性荨麻疹", "季节性大疱性皮炎", "结节性痒疹[海德氏病]", "局限性神经性皮炎（慢性单纯性苔癣）", "接触性湿疹NOS", "接触性皮炎NOS ", "酒精性皮炎", "角质层下小脓疱性皮炎", "颈部软组织感染", "急性化脓性淋巴结炎", "急性淋巴结腺炎", "急性淋巴结脓肿", "急性淋巴结炎", "急性腋淋巴结炎", "急性肩淋巴结炎", "急性髋淋巴结炎", "急性躯干淋巴结炎", "急性头部淋巴结炎", "急性面淋巴结炎", "急性颈淋巴结炎", "急性颌下淋巴结炎", "急性蜂窝织炎", "急性淋巴管炎伴脓肿或蜂窝织炎", "急性淋巴管炎", "颈部蜂窝组织炎", "急性臂淋巴管炎", "肩蜂窝织炎", "甲周炎", "甲床炎", "甲沟炎（瘭疽）", "疖肿病（多发性疖肿病）", "肩脓肿", "颈部痈", "颈部脓肿", "颈部疖", "颊部脓肿", "家族性慢性良性天疱疮", "结节病", "急性痘疮样苔癣样糠疹", "结节性血管炎", "金黄色苔藓", "静脉淤积性皮炎", "胫前粘液性水肿", "结缔组织痣", "基底细胞癌", "结节性硬化", "静脉湖", "急性泛发性发疹性脓疱型皮病", "Kimuru’s病（伴嗜酸性白细胞的血管增生）", "咖啡斑", "科克特殊性瘤", "口周皮炎", "糠疹", "昆虫性皮炎", "髋部脓肿", "溃疡性脓疱病", "口唇黑子病", "扩张孔", "淋巴管瘤（M91700/0）", "鳞状细胞癌", "蓝痣NOS（D22.-）", "淋巴管瘤NOS（D18.1）", "类军刀伤损害", "狼疮脂膜炎", "莱泽-特雷拉特病", "老年疣", "老年性皮脂腺增生（病-皮脂腺）", "滤泡性皮炎", "老年性皮肤松垂", "老年性角化病", "莱尔氏综合征（中毒性表皮坏死松解）", "冷荨麻疹", "链性红斑", "类银屑病", "淋巴瘤样丘疹病", "老年搔痒症", "氯化物溶剂引起的刺激性接触性皮炎", "类天疱疮NOS", "良性粘膜类天疱疮（瘢痕性类天疱疮）", "老年性疱疹样皮炎", "落叶状天疱疮[卡泽内夫氏病]", "淋巴结坏死", "脸部痈", "里特病", "类脂质渐进性坏死", "鳞状毛囊角化", "淋巴瘤", "朗格汉斯组织细胞增生症", "梅毒NOS", "毛发上皮瘤（D23.-）", "梅勒尼溃疡（慢性潜行性）", "面部肉芽肿[皮肤嗜酸性细胞肉芽肿]", "面部瘢痕", "慢性萎缩性肢皮炎", "毛囊周角化病[克尔]", "毛囊周围炎", "毛囊炎", "毛发囊肿", "毛干异常NOS", "毛色异常NOS", "毛发异色", "毛发扁平苔癣", "毛发稀少症", "慢性放射性皮炎", "慢性暴露于非电离辐射下引起的未特指的皮肤改变", "慢性荨麻疹", "毛发红糠疹[德佛扎氏病、红苔癣]", "玫瑰糠疹[吉伯特氏病]", "穆哈-黑贝曼病", "慢性单纯性苔癣", "弥漫性神经性皮炎", "慢性局限性类天疱疮", "面部蜂窝织炎", "帽状腱膜下脓肿", "面部疖肿", "merkel细胞癌", "毛母细胞癌", "毛母质瘤", "慢性苔藓样糠疹", "毛周角化症", "麻风NOS", "玫瑰痤疮", "牛奶斑", "脓疱性痤疮", "男性型多毛症", "脓肿性头部毛囊周围炎", "念珠状苔癣", "牛皮癣性关节炎[银屑病性关节炎]", "脓疱性银屑病", "内服物质引起的皮炎NOS", "镍引起的变应性接触性皮炎", "尿布疹（臀部红斑）", "尿布性皮炎", "内因性（变应性）湿疹", "颞皮肤感染", "脓疱疹", "脓毒性皮炎", "脓皮病", "脓疱性疹", "脓疱性细菌疹", "脓肿", "脓疱病性湿疹", "黏蛋白沉积症", "黏液瘤", "皮肤淀粉样变性", "皮肌炎", "皮内痣（D22.-）", "皮肤纤维瘤NOS（D23.-）", "平滑肌瘤NOS", "皮肤淋巴瘤（C84.5）", "皮肤病", "皮肤肿物", "皮肤瘘管", "皮肤淋巴细胞瘤", "皮肤粘蛋白沉积症", "皮肤溃疡[沙漠疮；热带溃疡]", "皮内钙质沉着", "皮下钙化", "盘状红斑狼疮（DLE）", "皮肤炎性肉芽肿", "皮下异物肉芽肿", "皮肤肥大性疾患NOS", "皮肤赘生物", "皮肤萎缩", "皮肤（老年性）萎缩", "皮肤上皮增生", "皮脂腺痣", "皮角", "皮肤干燥性皮炎", "皮肤干燥症", "皮肤角化病[后天性掌跖角化病]", "胼胝", "皮肤色素沉着", "皮肤异色病", "皮脂腺病", "皮肤滤泡囊肿NOS", "皮肤粉瘤", "皮脂囊肿（粉瘤）", "疱疹样脓疱病", "皮炎", "胼胝性湿疹", "皮毛过敏性皮炎", "疱疹性水疱", "皮肤棘层松解性疾患NOS", "疱疹样天疱疮", "皮肤感染", "皮肤感染性窦道", "皮肤病性淋巴结炎", "皮肤疖肿", "皮肤钙盐沉积伴肉芽肿形成", "皮脂腺异位", "皮赘（可查到根据部位命名的词汇，比如乳头皮赘）", "Paget病", "皮肤混合瘤", "皮脂腺瘤", "平滑肌瘤", "皮肤B细胞淋巴瘤", "皮肤转移癌", "皮肤腺癌", "皮肤异色病改变", "其他特指皮肤疾患", "其他浸润性皮肤疾患", "荨麻疹形血管炎", "青斑脉管炎", "其他特指的局限性结缔组织疾患", "其他皮肤肉芽肿性疾患", "雀斑", "其他顶（浆分）泌汗腺疾患", "其他外分泌汗腺疾患", "其他皮肤滤泡囊肿", "躯干皮下囊肿", "其他酒渣鼻", "其他痤疮", "其他多毛症", "其他瘢痕性脱发", "其他特指非瘢痕性毛发缺乏", "其他雄激素性脱发", "其他局限性脱发", "全身脱毛", "嵌甲", "其他晒伤", "其他慢性回状红斑", "荨麻疹NOS", "其他扁平苔癣", "屈侧牛皮癣", "钱币形牛皮癣", "钱币状湿疹（皮炎）", "丘疹性荨麻疹（荨麻疹性苔癣）（婴儿苔癣）（渗出性多形性红斑）", "其他内服物质引起的皮炎", "荨麻疹型药疹", "其他物质引起的未指定的接触性皮炎", "去污剂引起的刺激性接触性皮炎", "其他物质引起的变应性接触性皮炎", "其他化学产品接触性变应性皮炎", "其他脂溢性皮炎", "屈部湿疹", "其他特指大疱性皮炎", "其他特指皮肤棘层松解性疾患", "其他皮肤和皮下组织的局部感染", "脐部感染（脐炎）", "躯干皮肤感染", "其他部位急性淋巴结炎", "躯干部炎性肿物", "躯干部蜂窝组织炎", "髂窝脓肿", "髂窝（区）脓肿", "躯干部痈", "躯干部脓肿", "躯干部疖", "青斑样血管炎", "浅表脂肪瘤样痣", "雀斑样交界痣", "丘疹坏死性结核疹", "肉芽肿性唇炎[肥大性唇炎或巨口]", "热性嗜中性皮肤病[斯威特皮肤病]", "肉芽肿NOS", "褥疮", "融合性网状乳头状瘤[古热罗-卡尔托病或综合征]", "瑞氏黑变病", "热带粟疹", "热带痤疮", "日光性角化病", "日光性荨麻疹", "日晒红斑", "人为性荨麻疹", "热荨麻疹", "热带扁平苔癣", "溶剂类接触性皮炎", "染料接触性皮炎", "染发性皮炎", "染料接触性刺激性皮炎", "溶剂类接触性变应性皮炎", "染料引起的变应性接触性皮炎", "乳痂", "软组织感染", "融合性网状乳头瘤病", "日光性黑子病", "软纤维瘤", "乳房外Paget病", "乳头乳晕角化过度症", "肉芽肿性多血管炎", "色素沉着性隆凸性皮肤纤维肉瘤", "神经纤维瘤NOS", "手术后皮下瘘", "上肢溃疡", "手溃疡", "嗜酸细胞性蜂窝织炎[韦尔斯]", "神经性表皮脱落", "深部红斑狼疮", "嗜酸性淋巴肉芽肿", "上肢瘢痕", "手部瘢痕", "手术后瘢痕", "施韦宁格尔-布齐（有斑）皮肤松施", "石膏溃疡", "蚀疮性脓皮症", "色素皮肤病", "尚贝格色素皮肤病[进行性色素沉着性紫癜性皮肤病]", "色汗症", "深粟疹", "粟粒性坏死性痤疮", "晒伤NOS", "史蒂文斯-约翰逊二氏病（糜烂性多形红斑）", "湿疹样皮炎", "湿疹", "搔痒性皮炎", "搔痒症", "生殖器搔痒症", "神经性皮炎[维达耳氏病]", "食物性皮炎（摄入）", "食物引起的未特指的接触性皮炎", "松毛虫皮炎", "桑毛虫皮炎", "食物接触性皮肤引起的刺激性接触性皮炎", "食物变态反应（食物过敏）", "食物接触皮肤引起的性变应性皮炎", "斯内登-威尔金森病", "手指感染", "上肢感染", "手皮肤感染", "手掌间隙感染", "手蜂窝织炎", "手脓肿", "手部痈", "手部疖", "上肢痈", "上肢疖", "色素性痒疹", "嗜酸性筋膜炎", "色素性紫癜性皮病", "色素性荨麻疹（肥大细胞增生症）", "sweet综合症", "嗜酸性脓疱性毛囊炎", "嗜酸粒细胞肉芽肿性多血管炎", "手癣", "水痘", "臀部慢性溃疡", "特指的局限于皮肤的血（脉）管炎", "痛性瘢痕", "特发性皮肤萎缩", "头颈部皮下囊肿", "脱发性痤疮[毛囊炎][坎科氏病]", "脱发NOS", "头部全秃", "烫伤样皮肤综合征（中毒性表皮坏死）[莱尔综合征]", "条纹状苔癣", "苔癣样药物反应", "苔癣痘疹样糠疹", "苔癣样皮炎", "苔癣", "头皮糠疹", "特应性皮炎", "特应性神经性皮炎", "天疱疮NOS", "臀皮肤感染", "头面颈部皮肤感染", "腿急性淋巴管炎", "头部蜂窝织炎", "臀蜂窝织炎", "腿蜂窝织炎", "头部脓肿", "头部痈", "头部皮肤脓肿", "头部疖", "腿脓肿", "腿部痈", "腿部疖", "臀部痈", "臀脓肿", "臀部疖", "透明节段性血管炎", "太田痣", "头癣", "萎缩纹", "纹身", "无汗", "网状红斑萎缩性毛囊炎", "网状类牛皮癣", "外阴搔痒症", "尾骨瘘", "腕蜂窝织炎", "纹身后炎症反应", "外毛根鞘癌", "外毛根鞘囊肿", "寻常疣", "血管炎（脉管炎）", "寻常性天疱疮（恶性天疱疮）", "细胞性蓝痣（D22.-）", "血管瘤NOS（D18.0）", "血管淋巴管瘤（D18.1）", "蕈样肉芽肿（C84.0）", "下肢溃疡", "血管性萎缩性皮肤异色症（病）", "线状硬皮病", "下肢瘢痕", "先天性着色斑", "须疮", "须部假毛囊炎", "雄激素性脱发NOS", "西瓦特皮肤异色病", "夏季水疱", "猩红热样红斑", "小斑块状类牛皮癣", "寻常性银屑病", "洗鱼类引起的皮炎", "洗涤剂过敏引起的皮炎", "新生儿皮肤湿疹", "线状lgA大疱性皮炎", "下肢软组织感染", "下肢皮肤感染", "先天性胸壁皮肤窦道伴脓肿", "胸壁蜂窝组织炎", "膝蜂窝织炎", "新生儿疖肿", "胸壁脓肿", "新生儿大疱性脓疮", "新生儿天疱疮", "新生儿脓疱病", "小汗腺汗囊瘤", "鞋钉样血管瘤", "血管角皮瘤", "血管淋巴管瘤（两个）", "血管淋巴样增生伴嗜酸性粒细胞增多症", "血管平滑肌瘤", "先天性痣", "疣", "硬皮病", "晕样痣(D22.-)", "鱼鳞病[鱼鳞廯]NOS", "亚急性皮肤型红斑狼疮", "颜面部萎缩", "雅棕松-佩利扎里(有斑)皮肤松弛", "硬化性萎缩性苔廯[白点病]", "炎症后色素沉着过度", "婴儿痤疮", "药物性脱发", "与辐射有关的其他特指皮肤疾患", "药物光变应反应", "药物光毒性反应", "硬红斑", "婴儿丘疹性皮炎[詹诺托-克罗斯蒂]", "银屑病[牛皮癣]", "银屑病性肾炎", "眼睑湿疹", "阴囊湿疹", "异位性皮炎", "阴囊瘙痒症", "痒疹", "药物引起的局部性皮疹", "药物性全身性皮炎", "药物性全身性红斑", "药物性皮炎(药物疹)", "药物性红斑", "药物接触性皮炎", "药物接触性皮肤引起的刺激性接触性皮炎", "油脂引起的刺激性接触性皮炎", "药物接触性变应性皮炎", "银屑病样尿布", "婴儿脂溢性皮炎", "婴儿脱屑性红皮病[莱纳氏病]", "婴儿湿疹", "幼年性疱疹样皮炎", "眼类天疱疮", "药物性天疱疮", "亚急性坏死性淋巴结炎", "痈", "腋脓肿", "银屑病甲", "硬化萎缩性苔藓", "颜面播散型栗粒性狼疮", "疣状表皮发育不良", "疣状表皮痣", "原位肢端雀斑样黑素瘤", "脂肪瘤(M88500/0)NOS", "痣NOS(M87200/0)", "脂膜炎NOS", "粘液水肿性苔藓", "肘溃疡", "足溃疡", "自发性断趾病[阿洪病]", "指[趾]硬皮病", "赘生肉芽", "脂性渐进性坏死[奥本海姆乌尔巴赫病]", "黏连性瘢痕", "脂溢性角化症[基底细胞乳头状瘤]", "脂囊瘤", "脂溢性脱发", "早老性脱发", "粘蛋白性脱发", "再生期脱发", "趾甲周新生物", "指[趾]甲下出血", "紫外线辐射引起的急性皮肤改变", "中毒性皮肤疹", "中毒性红斑", "震动性荨麻疹", "掌跖脓疱病", "肢皮炎", "自体过敏性皮炎(自体过敏性湿疹)", "职业性皮炎", "植物接触性皮炎", "植物引起的刺激性皮炎，除食物外", "植物接触性变应性皮炎", "粘性物质引起的变应性接触性皮炎", "脂溢性湿疹", "脂溢性皮炎", "增殖型天疱疮(诺伊曼氏病)", "趾(皮)感染", "足软组织感染", "足皮肤感染", "肢体皮肤感染", "增殖性脓皮病", "藏毛囊肿伴脓肿", "足蜂窝织炎", "趾蜂窝织炎", "指蜂窝织炎", "趾甲沟炎", "指甲沟炎", "指甲沟脓肿", "指甲床炎", "指蜂窝组织炎", "趾脓肿", "指脓肿", "足脓肿", "足部痈", "足部疖", "着色芽生菌病", "粘液水肿性苔廯", "脂肪瘤样痣", "肢端复合痣", "肢端交界痣", "痣", "种痘样水疱病", "种痘样水泡病样T细胞淋巴瘤", "真菌感染", "足廯"],

        search: function (query) {
            var ret = [];
            for (var i = 0; i < diseasePool.data.length; i++) {
                if (diseasePool.data[i].indexOf(query) >= 0) {
                    ret.push(diseasePool.data[i]);
                }
            }
            return ret;
        },

        get: function (name) {
            var ret = null;
            for (var i = 0; i < diseasePool.data.length; i++) {
                if (diseasePool.data[i] == name) {
                    ret = name;
                    break;
                }
            }
            return ret;
        },

        load: function () {
            var storeData = localStorage.getItem("diseases");
            if (storeData) {
                this.data = storeData.split(",");
            }
            localStorage.setItem("diseases", this.data.join(","));
        },

        save: function () {
            localStorage.setItem("diseases", this.data.join(","));
        },

        addDisease: function (name) {
            if (this.get(name) == null) {
                this.data.push(name);
                this.save();
            }
        }

    };

    diseasePool.load();


})(window);
